Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.2.35/samg54/atdf/ATSAMG54G19.atdf
          </instance>
        </module>
        <module name="EFC" id="6450" version="T">
          <instance name="EFC">
            <register-group address-space="base" name="EFC" name-in-module="EFC" offset="0x400E0A00"/>
            <signals>
              <signal pad="PB12" function="X1" group="ERASE"/>
            </signals>
            <parameters>
              <param name="FLASH_SIZE" value="524288"/>
              <param name="PAGE_SIZE" value="512"/>
              <param name="PAGES_PR_REGION" value="16"/>
              <param name="INSTANCE_ID" value="6"/>
            </parameters>
          </instance>
        </module>
        <module name="GPBR" id="6378" version="G">
          <instance name="GPBR">
            <register-group address-space="base" name="GPBR" name-in-module="GPBR" offset="0x400E1490"/>
          </instance>
        </module>
        <module name="ICE">
          <instance name="ICE">
            <signals>
              <signal pad="PB4" function="X1" group="TDI"/>
              <signal pad="PB5" function="X1" group="TDO"/>
              <signal pad="PB5" function="X1" group="TRACESWO"/>
              <signal pad="PB6" function="X1" group="TMS"/>
              <signal pad="PB6" function="X1" group="SWDIO"/>
              <signal pad="PB7" function="X1" group="TCK"/>
              <signal pad="PB7" function="X1" group="SWDCLK"/>
            </signals>
          </instance>
        </module>
        <module name="I2SC" id="11241" version="E">
          <instance name="I2SC0">
            <register-group address-space="base" name="I2SC0" name-in-module="I2SC" offset="0x40000000"/>
            <signals>
              <signal pad="PA0" function="A" group="I2SC0_CK"/>
              <signal pad="PA2" function="B" group="I2SC0_DI" index="0"/>
              <signal pad="PA3" function="B" group="I2SC0_DO" index="0"/>
              <signal pad="PA17" function="A" group="I2SC0_DO" index="0"/>
              <signal pad="PA4" function="B" group="I2SC0_MCK"/>
              <signal pad="PA18" function="A" group="I2SC0_MCK"/>
              <signal pad="PA1" function="A" group="I2SC0_WS"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX0" value="17"/>
              <param name="DMAC_ID_TX1" value="18"/>
              <param name="DMAC_ID_RX0" value="2"/>
              <param name="DMAC_ID_RX1" value="3"/>
              <param name="INSTANCE_ID" value="16"/>
              <param name="CLOCK_ID" value="16"/>
            </parameters>
          </instance>
          <instance name="I2SC1">
            <register-group address-space="base" name="I2SC1" name-in-module="I2SC" offset="0x40004000"/>
            <signals>
              <signal pad="PA19" function="B" group="I2SC1_CK"/>
              <signal pad="PA22" function="B" group="I2SC1_DI" index="0"/>
              <signal pad="PA23" function="A" group="I2SC1_DO" index="0"/>
              <signal pad="PA24" function="A" group="I2SC1_MCK"/>
              <signal pad="PA20" function="B" group="I2SC1_WS"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX0" value="19"/>
              <param name="DMAC_ID_TX1" value="20"/>
              <param name="DMAC_ID_RX0" value="4"/>
              <param name="DMAC_ID_RX1" value="5"/>
              <param name="INSTANCE_ID" value="17"/>
              <param name="CLOCK_ID" value="17"/>
            </parameters>
          </instance>
        </module>
        <module name="MATRIX" id="11049" version="E">
          <instance name="MATRIX">
            <register-group address-space="base" name="MATRIX" name-in-module="MATRIX" offset="0x400E0200"/>
          </instance>
        </module>
        <module name="MEM2MEM" id="11211" version="A">
          <instance name="MEM2MEM">
            <register-group address-space="base" name="MEM2MEM" name-in-module="MEM2MEM" offset="0x40028000"/>
            <parameters>
              <param name="DMAC_ID_RX" value="15"/>
              <param name="DMAC_ID_TX" value="27"/>
              <param name="INSTANCE_ID" value="15"/>
              <param name="CLOCK_ID" value="15"/>
            </parameters>
          </instance>
        </module>
        <module name="PDMIC" id="11237" version="D">
          <instance name="PDMIC0">
            <register-group address-space="base" name="PDMIC0" name-in-module="PDMIC" offset="0x4002C000"/>
            <signals>
              <signal pad="PA10" function="B" group="PDMIC0_CLK"/>
              <signal pad="PA9" function="B" group="PDMIC0_DAT"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="6"/>
              <param name="INSTANCE_ID" value="13"/>
              <param name="CLOCK_ID" value="13"/>
            </parameters>
          </instance>
          <instance name="PDMIC1">
            <register-group address-space="base" name="PDMIC1" name-in-module="PDMIC" offset="0x40030000"/>
            <parameters>
              <param name="DMAC_ID_RX" value="7"/>
              <param name="INSTANCE_ID" value="18"/>
              <param name="CLOCK_ID" value="18"/>
            </parameters>
          </instance>
        </module>
        <module name="PIO" id="11004" version="R">
          <instance name="PIOA">
            <register-group address-space="base" name="PIOA" name-in-module="PIO" offset="0x400E0E00"/>
            <signals>
              <signal group="P" index="0" function="default" pad="PA0"/>
              <signal group="P" index="1" function="default" pad="PA1"/>
              <signal group="P" index="2" function="default" pad="PA2"/>
              <signal group="P" index="3" function="default" pad="PA3"/>
              <signal group="P" index="4" function="default" pad="PA4"/>
              <signal group="P" index="5" function="default" pad="PA5"/>
              <signal group="P" index="6" function="default" pad="PA6"/>
              <signal group="P" index="7" function="default" pad="PA7"/>
              <signal group="P" index="8" function="default" pad="PA8"/>
              <signal group="P" index="9" function="default" pad="PA9"/>
              <signal group="P" index="10" function="default" pad="PA10"/>
              <signal group="P" index="11" function="default" pad="PA11"/>
              <signal group="P" index="12" function="default" pad="PA12"/>
              <signal group="P" index="13" function="default" pad="PA13"/>
              <signal group="P" index="14" function="default" pad="PA14"/>
              <signal group="P" index="15" function="default" pad="PA15"/>
              <signal group="P" index="16" function="default" pad="PA16"/>
              <signal group="P" index="17" function="default" pad="PA17"/>
              <signal group="P" index="18" function="default" pad="PA18"/>
              <signal group="P" index="19" function="default" pad="PA19"/>
              <signal group="P" index="20" function="default" pad="PA20"/>
              <signal group="P" index="21" function="default" pad="PA21"/>
              <signal group="P" index="22" function="default" pad="PA22"/>
              <signal group="P" index="23" function="default" pad="PA23"/>
              <signal group="P" index="24" function="default" pad="PA24"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="11"/>
              <param name="CLOCK_ID" value="11"/>
            </parameters>
          </instance>
          <instance name="PIOB">
            <register-group address-space="base" name="PIOB" name-in-module="PIO" offset="0x400E1000"/>
            <signals>
              <signal group="P" index="32" function="default" pad="PB0"/>
              <signal group="P" index="33" function="default" pad="PB1"/>
              <signal group="P" index="34" function="default" pad="PB2"/>
              <signal group="P" index="35" function="default" pad="PB3"/>
              <signal group="P" index="36" function="default" pad="PB4"/>
              <signal group="P" index="37" function="default" pad="PB5"/>
              <signal group="P" index="38" function="default" pad="PB6"/>
              <signal group="P" index="39" function="default" pad="PB7"/>
              <signal group="P" index="40" function="default" pad="PB8"/>
              <signal group="P" index="41" function="default" pad="PB9"/>
              <signal group="P" index="42" function="default" pad="PB10"/>
              <signal group="P" index="43" function="default" pad="PB11"/>
              <signal group="P" index="44" function="default" pad="PB12"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="12"/>
              <param name="CLOCK_ID" value="12"/>
            </parameters>
          </instance>
        </module>
        <module name="PMC" id="11116" version="S">
          <instance name="PMC">
            <register-group address-space="base" name="PMC" name-in-module="PMC" offset="0x400E0400"/>
            <signals>
              <signal pad="PA6" function="B" group="PCK" index="0"/>
              <signal pad="PA17" function="B" group="PCK" index="1"/>
              <signal pad="PA21" function="B" group="PCK" index="1"/>
              <signal pad="PA18" function="B" group="PCK" index="2"/>
              <signal pad="PB3" function="B" group="PCK" index="2"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="5"/>
              <param name="PLLA_MULA_MIN" value="24"/>
              <param name="PLLA_MULA_MAX" value="3000"/>
            </parameters>
          </instance>
        </module>
