Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.2.35/samg54/atdf/ATSAMG54G19.atdf
      <value-group caption="" name="EEFC_FCR__FKEY">
        <value caption="The 0x5A value enables the command defined by the bits of the register. If the field is written with a different value, the write is not performed and no action is started." name="PASSWD" value="0x5A"/>
      </value-group>
    </module>
    <module name="GPBR" caption="General Purpose Backup Registers" id="6378" version="G">
      <register-group name="GPBR">
        <register caption="General Purpose Backup Register 0" name="SYS_GPBR" offset="0x0" rw="RW" size="4" count="8">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
      </register-group>
    </module>
    <module name="I2SC" caption="Inter-IC Sound Controller" id="11241" version="E">
      <register-group name="I2SC">
        <register caption="Control Register" name="I2SC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Receiver Enable" mask="0x00000001" name="RXEN"/>
          <bitfield caption="Receiver Disable" mask="0x00000002" name="RXDIS"/>
          <bitfield caption="Clocks Enable" mask="0x00000004" name="CKEN"/>
          <bitfield caption="Clocks Disable" mask="0x00000008" name="CKDIS"/>
          <bitfield caption="Transmitter Enable" mask="0x00000010" name="TXEN"/>
          <bitfield caption="Transmitter Disable" mask="0x00000020" name="TXDIS"/>
          <bitfield caption="Software Reset" mask="0x00000080" name="SWRST"/>
        </register>
        <register caption="Mode Register" name="I2SC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Inter-IC Sound Controller Mode" mask="0x00000001" name="MODE" values="I2SC_MR__MODE"/>
          <bitfield caption="Data Word Length" mask="0x0000001C" name="DATALENGTH" values="I2SC_MR__DATALENGTH"/>
          <bitfield caption="Receive Mono" mask="0x00000100" name="RXMONO"/>
          <bitfield caption="Single or Multiple PDC Channels for Receiver" mask="0x00000200" name="RXDMA"/>
          <bitfield caption="Loop-back Test Mode" mask="0x00000400" name="RXLOOP"/>
          <bitfield caption="Transmit Mono" mask="0x00001000" name="TXMONO"/>
          <bitfield caption="Single or Multiple PDC Channels for Transmitter" mask="0x00002000" name="TXDMA"/>
          <bitfield caption="Transmit Data when Underrun" mask="0x00004000" name="TXSAME"/>
          <bitfield caption="Peripheral Clock to I2SC Master Clock Ratio" mask="0x003F0000" name="IMCKDIV"/>
          <bitfield caption="Master Clock to fs Ratio" mask="0x3F000000" name="IMCKFS" values="I2SC_MR__IMCKFS"/>
          <bitfield caption="Master Clock Mode" mask="0x40000000" name="IMCKMODE"/>
          <bitfield caption="I2SWS TDM Slot Width" mask="0x80000000" name="IWS"/>
        </register>
        <register caption="Status Register" name="I2SC_SR" offset="0x08" rw="R" size="4">
          <bitfield caption="Receiver Enabled" mask="0x00000001" name="RXEN"/>
          <bitfield caption="Receive Ready" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Receive Overrun" mask="0x00000004" name="RXOR"/>
          <bitfield caption="End of Receiver Transfer" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="Transmitter Enabled" mask="0x00000010" name="TXEN"/>
          <bitfield caption="Transmit Ready" mask="0x00000020" name="TXRDY"/>
          <bitfield caption="Transmit Underrun" mask="0x00000040" name="TXUR"/>
          <bitfield caption="End of Transmitter Transfer" mask="0x00000080" name="ENDTX"/>
          <bitfield caption="Receive Overrun Channel" mask="0x00000300" name="RXORCH"/>
          <bitfield caption="Receive Buffer Full" mask="0x00080000" name="RXBUFF"/>
          <bitfield caption="Transmit Underrun Channel" mask="0x00300000" name="TXURCH"/>
          <bitfield caption="Transmit Buffer Empty" mask="0x80000000" name="TXBUFE"/>
        </register>
        <register caption="Status Clear Register" name="I2SC_SCR" offset="0x0C" rw="W" size="4">
          <bitfield caption="Receive Overrun Status Clear" mask="0x00000004" name="RXOR"/>
          <bitfield caption="Transmit Underrun Status Clear" mask="0x00000040" name="TXUR"/>
          <bitfield caption="Receive Overrun Per Channel Status Clear" mask="0x00000300" name="RXORCH"/>
          <bitfield caption="Transmit Underrun Per Channel Status Clear" mask="0x00300000" name="TXURCH"/>
        </register>
        <register caption="Status Set Register" name="I2SC_SSR" offset="0x10" rw="W" size="4">
          <bitfield caption="Receive Overrun Status Set" mask="0x00000004" name="RXOR"/>
          <bitfield caption="Transmit Underrun Status Set" mask="0x00000040" name="TXUR"/>
          <bitfield caption="Receive Overrun Per Channel Status Set" mask="0x00000300" name="RXORCH"/>
          <bitfield caption="Transmit Underrun Per Channel Status Set" mask="0x00300000" name="TXURCH"/>
        </register>
        <register caption="Interrupt Enable Register" name="I2SC_IER" offset="0x14" rw="W" size="4" atomic-op="set:I2SC_IMR">
          <bitfield caption="Receiver Ready Interrupt Enable" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Receiver Overrun Interrupt Enable" mask="0x00000004" name="RXOR"/>
          <bitfield caption="End of Reception Interrupt Enable" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="Transmit Ready Interrupt Enable" mask="0x00000020" name="TXRDY"/>
          <bitfield caption="Transmit Underflow Interrupt Enable" mask="0x00000040" name="TXUR"/>
          <bitfield caption="End of Transmission Interrupt Enable" mask="0x00000080" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Enable" mask="0x00080000" name="RXFULL"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Enable" mask="0x80000000" name="TXEMPTY"/>
        </register>
        <register caption="Interrupt Disable Register" name="I2SC_IDR" offset="0x18" rw="W" size="4" atomic-op="clear:I2SC_IMR">
          <bitfield caption="Receiver Ready Interrupt Disable" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Receiver Overrun Interrupt Disable" mask="0x00000004" name="RXOR"/>
          <bitfield caption="End of Reception Interrupt Disable" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="Transmit Ready Interrupt Disable" mask="0x00000020" name="TXRDY"/>
          <bitfield caption="Transmit Underflow Interrupt Disable" mask="0x00000040" name="TXUR"/>
          <bitfield caption="End of Transmission Interrupt Disable" mask="0x00000080" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Disable" mask="0x00080000" name="RXFULL"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Disable" mask="0x80000000" name="TXEMPTY"/>
        </register>
        <register caption="Interrupt Mask Register" name="I2SC_IMR" offset="0x1C" rw="R" size="4" atomic-op="read:I2SC_IMR">
          <bitfield caption="Receiver Ready Interrupt Disable" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Receiver Overrun Interrupt Disable" mask="0x00000004" name="RXOR"/>
          <bitfield caption="End of Reception Interrupt Disable" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="Transmit Ready Interrupt Disable" mask="0x00000020" name="TXRDY"/>
          <bitfield caption="Transmit Underflow Interrupt Disable" mask="0x00000040" name="TXUR"/>
          <bitfield caption="End of Transmission Interrupt Disable" mask="0x00000080" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Disable" mask="0x00080000" name="RXFULL"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Disable" mask="0x80000000" name="TXEMPTY"/>
        </register>
        <register caption="Receiver Holding Register" name="I2SC_RHR" offset="0x20" rw="R" size="4">
          <bitfield caption="Receiver Holding Register" mask="0xFFFFFFFF" name="RHR"/>
        </register>
        <register caption="Transmitter Holding Register" name="I2SC_THR" offset="0x24" rw="W" size="4">
          <bitfield caption="Transmitter Holding Register" mask="0xFFFFFFFF" name="THR"/>
        </register>
