Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.2.35/samg54/atdf/ATSAMG54G19.atdf
        <register caption="SleepWalking Disable Register 0" name="PMC_SLPWK_DR0" offset="0x118" rw="W" size="4" atomic-op="clear:PMC_SLPWK_SR0">
          <bitfield caption="Peripheral 8 SleepWalking Disable" mask="0x00000100" name="PID8"/>
          <bitfield caption="Peripheral 9 SleepWalking Disable" mask="0x00000200" name="PID9"/>
          <bitfield caption="Peripheral 10 SleepWalking Disable" mask="0x00000400" name="PID10"/>
          <bitfield caption="Peripheral 11 SleepWalking Disable" mask="0x00000800" name="PID11"/>
          <bitfield caption="Peripheral 12 SleepWalking Disable" mask="0x00001000" name="PID12"/>
          <bitfield caption="Peripheral 13 SleepWalking Disable" mask="0x00002000" name="PID13"/>
          <bitfield caption="Peripheral 14 SleepWalking Disable" mask="0x00004000" name="PID14"/>
          <bitfield caption="Peripheral 15 SleepWalking Disable" mask="0x00008000" name="PID15"/>
          <bitfield caption="Peripheral 16 SleepWalking Disable" mask="0x00010000" name="PID16"/>
          <bitfield caption="Peripheral 17 SleepWalking Disable" mask="0x00020000" name="PID17"/>
          <bitfield caption="Peripheral 18 SleepWalking Disable" mask="0x00040000" name="PID18"/>
          <bitfield caption="Peripheral 19 SleepWalking Disable" mask="0x00080000" name="PID19"/>
          <bitfield caption="Peripheral 20 SleepWalking Disable" mask="0x00100000" name="PID20"/>
          <bitfield caption="Peripheral 21 SleepWalking Disable" mask="0x00200000" name="PID21"/>
          <bitfield caption="Peripheral 22 SleepWalking Disable" mask="0x00400000" name="PID22"/>
          <bitfield caption="Peripheral 23 SleepWalking Disable" mask="0x00800000" name="PID23"/>
          <bitfield caption="Peripheral 24 SleepWalking Disable" mask="0x01000000" name="PID24"/>
          <bitfield caption="Peripheral 25 SleepWalking Disable" mask="0x02000000" name="PID25"/>
          <bitfield caption="Peripheral 26 SleepWalking Disable" mask="0x04000000" name="PID26"/>
          <bitfield caption="Peripheral 27 SleepWalking Disable" mask="0x08000000" name="PID27"/>
          <bitfield caption="Peripheral 28 SleepWalking Disable" mask="0x10000000" name="PID28"/>
          <bitfield caption="Peripheral 29 SleepWalking Disable" mask="0x20000000" name="PID29"/>
        </register>
        <register caption="SleepWalking Status Register 0" name="PMC_SLPWK_SR0" offset="0x11C" rw="R" size="4">
          <bitfield caption="Peripheral 8 SleepWalking Status" mask="0x00000100" name="PID8"/>
          <bitfield caption="Peripheral 9 SleepWalking Status" mask="0x00000200" name="PID9"/>
          <bitfield caption="Peripheral 10 SleepWalking Status" mask="0x00000400" name="PID10"/>
          <bitfield caption="Peripheral 11 SleepWalking Status" mask="0x00000800" name="PID11"/>
          <bitfield caption="Peripheral 12 SleepWalking Status" mask="0x00001000" name="PID12"/>
          <bitfield caption="Peripheral 13 SleepWalking Status" mask="0x00002000" name="PID13"/>
          <bitfield caption="Peripheral 14 SleepWalking Status" mask="0x00004000" name="PID14"/>
          <bitfield caption="Peripheral 15 SleepWalking Status" mask="0x00008000" name="PID15"/>
          <bitfield caption="Peripheral 16 SleepWalking Status" mask="0x00010000" name="PID16"/>
          <bitfield caption="Peripheral 17 SleepWalking Status" mask="0x00020000" name="PID17"/>
          <bitfield caption="Peripheral 18 SleepWalking Status" mask="0x00040000" name="PID18"/>
          <bitfield caption="Peripheral 19 SleepWalking Status" mask="0x00080000" name="PID19"/>
          <bitfield caption="Peripheral 20 SleepWalking Status" mask="0x00100000" name="PID20"/>
          <bitfield caption="Peripheral 21 SleepWalking Status" mask="0x00200000" name="PID21"/>
          <bitfield caption="Peripheral 22 SleepWalking Status" mask="0x00400000" name="PID22"/>
          <bitfield caption="Peripheral 23 SleepWalking Status" mask="0x00800000" name="PID23"/>
          <bitfield caption="Peripheral 24 SleepWalking Status" mask="0x01000000" name="PID24"/>
          <bitfield caption="Peripheral 25 SleepWalking Status" mask="0x02000000" name="PID25"/>
          <bitfield caption="Peripheral 26 SleepWalking Status" mask="0x04000000" name="PID26"/>
          <bitfield caption="Peripheral 27 SleepWalking Status" mask="0x08000000" name="PID27"/>
          <bitfield caption="Peripheral 28 SleepWalking Status" mask="0x10000000" name="PID28"/>
          <bitfield caption="Peripheral 29 SleepWalking Status" mask="0x20000000" name="PID29"/>
        </register>
        <register caption="SleepWalking Activity Status Register 0" name="PMC_SLPWK_ASR0" offset="0x120" rw="R" size="4">
          <bitfield caption="Peripheral 8 Activity Status" mask="0x00000100" name="PID8"/>
          <bitfield caption="Peripheral 9 Activity Status" mask="0x00000200" name="PID9"/>
          <bitfield caption="Peripheral 10 Activity Status" mask="0x00000400" name="PID10"/>
          <bitfield caption="Peripheral 11 Activity Status" mask="0x00000800" name="PID11"/>
          <bitfield caption="Peripheral 12 Activity Status" mask="0x00001000" name="PID12"/>
          <bitfield caption="Peripheral 13 Activity Status" mask="0x00002000" name="PID13"/>
          <bitfield caption="Peripheral 14 Activity Status" mask="0x00004000" name="PID14"/>
          <bitfield caption="Peripheral 15 Activity Status" mask="0x00008000" name="PID15"/>
          <bitfield caption="Peripheral 16 Activity Status" mask="0x00010000" name="PID16"/>
          <bitfield caption="Peripheral 17 Activity Status" mask="0x00020000" name="PID17"/>
          <bitfield caption="Peripheral 18 Activity Status" mask="0x00040000" name="PID18"/>
          <bitfield caption="Peripheral 19 Activity Status" mask="0x00080000" name="PID19"/>
          <bitfield caption="Peripheral 20 Activity Status" mask="0x00100000" name="PID20"/>
          <bitfield caption="Peripheral 21 Activity Status" mask="0x00200000" name="PID21"/>
          <bitfield caption="Peripheral 22 Activity Status" mask="0x00400000" name="PID22"/>
          <bitfield caption="Peripheral 23 Activity Status" mask="0x00800000" name="PID23"/>
          <bitfield caption="Peripheral 24 Activity Status" mask="0x01000000" name="PID24"/>
          <bitfield caption="Peripheral 25 Activity Status" mask="0x02000000" name="PID25"/>
          <bitfield caption="Peripheral 26 Activity Status" mask="0x04000000" name="PID26"/>
          <bitfield caption="Peripheral 27 Activity Status" mask="0x08000000" name="PID27"/>
          <bitfield caption="Peripheral 28 Activity Status" mask="0x10000000" name="PID28"/>
          <bitfield caption="Peripheral 29 Activity Status" mask="0x20000000" name="PID29"/>
        </register>
        <register caption="PLL Maximum Multiplier Value Register" name="PMC_PMMR" offset="0x130" rw="RW" size="4">
          <bitfield caption="PLLA Maximum Allowed Multiplier Value" mask="0x000007FF" name="PLLA_MMAX"/>
        </register>
      </register-group>
