Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.2.35/samg54/atdf/ATSAMG54G19.atdf
      <value-group caption="" name="SUPC_SR__SMS">
        <value caption="No supply monitor detection since the last read of SUPC_SR." name="NO" value="0"/>
        <value caption="At least one supply monitor detection since the last read of SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__SMOS">
        <value caption="The supply monitor detected VDDIO higher than its threshold at its last measurement." name="HIGH" value="0"/>
        <value caption="The supply monitor detected VDDIO lower than its threshold at its last measurement." name="LOW" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__OSCSEL">
        <value caption="The slow clock SLCK is generated by the embedded 32 kHz RC oscillator." name="RC" value="0"/>
        <value caption="The slow clock SLCK is generated by the 32 kHz crystal oscillator." name="CRYST" value="1"/>
      </value-group>
    </module>
    <module name="TC" caption="Timer Counter" id="6082" version="ZB">
      <register-group name="TC_CHANNEL" size="64">
        <register caption="Channel Control Register (channel = 0)" name="TC_CCR" offset="0x00" rw="W" size="4">
          <bitfield caption="Counter Clock Enable Command" mask="0x00000001" name="CLKEN"/>
          <bitfield caption="Counter Clock Disable Command" mask="0x00000002" name="CLKDIS"/>
          <bitfield caption="Software Trigger Command" mask="0x00000004" name="SWTRG"/>
        </register>
        <register caption="Channel Mode Register (channel = 0)" name="TC_CMR" offset="0x04" rw="RW" size="4">
          <mode name="CAPTURE" qualifier="TC_CMR.WAVE" value="0x0" caption="Capture"/>
          <mode name="WAVEFORM" qualifier="TC_CMR.WAVE" value="0x1" caption="Waveform"/>
          <bitfield caption="Clock Selection" mask="0x00000007" name="TCCLKS" values="TC_CMR0__TCCLKS"/>
          <bitfield caption="Clock Invert" mask="0x00000008" name="CLKI"/>
          <bitfield caption="Burst Signal Selection" mask="0x00000030" name="BURST" values="TC_CMR0__BURST"/>
          <bitfield modes="CAPTURE" caption="Counter Clock Stopped with RB Loading" mask="0x00000040" name="LDBSTOP"/>
          <bitfield modes="WAVEFORM" caption="Counter Clock Stopped with RC Compare" mask="0x00000040" name="CPCSTOP"/>
          <bitfield modes="CAPTURE" caption="Counter Clock Disable with RB Loading" mask="0x00000080" name="LDBDIS"/>
          <bitfield modes="WAVEFORM" caption="Counter Clock Disable with RC Loading" mask="0x00000080" name="CPCDIS"/>
          <bitfield modes="CAPTURE" caption="External Trigger Edge Selection" mask="0x00000300" name="ETRGEDG" values="TC_CMR0__ETRGEDG"/>
          <bitfield modes="WAVEFORM" caption="External Event Edge Selection" mask="0x00000300" name="EEVTEDG" values="TC_CMR0__EEVTEDG"/>
          <bitfield modes="CAPTURE" caption="TIOAx or TIOBx External Trigger Selection" mask="0x00000400" name="ABETRG"/>
          <bitfield modes="WAVEFORM" caption="External Event Selection" mask="0x00000C00" name="EEVT" values="TC_CMR0__EEVT"/>
          <bitfield modes="WAVEFORM" caption="External Event Trigger Enable" mask="0x00001000" name="ENETRG"/>
          <bitfield modes="WAVEFORM" caption="Waveform Selection" mask="0x00006000" name="WAVSEL" values="TC_CMR0__WAVSEL"/>
          <bitfield modes="CAPTURE" caption="RC Compare Trigger Enable" mask="0x00004000" name="CPCTRG"/>
          <bitfield caption="Waveform Mode" mask="0x00008000" name="WAVE"/>
          <bitfield modes="CAPTURE" caption="RA Loading Edge Selection" mask="0x00030000" name="LDRA" values="TC_CMR0__LDRA"/>
          <bitfield modes="WAVEFORM" caption="RA Compare Effect on TIOAx" mask="0x00030000" name="ACPA" values="TC_CMR0__ACPA"/>
          <bitfield modes="CAPTURE" caption="RB Loading Edge Selection" mask="0x000C0000" name="LDRB" values="TC_CMR0__LDRB"/>
          <bitfield modes="WAVEFORM" caption="RC Compare Effect on TIOAx" mask="0x000C0000" name="ACPC" values="TC_CMR0__ACPC"/>
          <bitfield modes="WAVEFORM" caption="External Event Effect on TIOAx" mask="0x00300000" name="AEEVT" values="TC_CMR0__AEEVT"/>
          <bitfield modes="WAVEFORM" caption="Software Trigger Effect on TIOAx" mask="0x00C00000" name="ASWTRG" values="TC_CMR0__ASWTRG"/>
          <bitfield modes="WAVEFORM" caption="RB Compare Effect on TIOBx" mask="0x03000000" name="BCPB" values="TC_CMR0__BCPB"/>
          <bitfield modes="WAVEFORM" caption="RC Compare Effect on TIOBx" mask="0x0C000000" name="BCPC" values="TC_CMR0__BCPC"/>
          <bitfield modes="WAVEFORM" caption="External Event Effect on TIOBx" mask="0x30000000" name="BEEVT" values="TC_CMR0__BEEVT"/>
          <bitfield modes="WAVEFORM" caption="Software Trigger Effect on TIOBx" mask="0xC0000000" name="BSWTRG" values="TC_CMR0__BSWTRG"/>
        </register>
        <register caption="Stepper Motor Mode Register (channel = 0)" name="TC_SMMR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Gray Count Enable" mask="0x00000001" name="GCEN"/>
          <bitfield caption="Down Count" mask="0x00000002" name="DOWN"/>
        </register>
        <register caption="Counter Value (channel = 0)" name="TC_CV" offset="0x10" rw="R" size="4">
          <bitfield caption="Counter Value" mask="0xFFFFFFFF" name="CV"/>
        </register>
        <register caption="Register A (channel = 0)" name="TC_RA" offset="0x14" rw="RW" size="4">
          <bitfield caption="Register A" mask="0xFFFFFFFF" name="RA"/>
        </register>
        <register caption="Register B (channel = 0)" name="TC_RB" offset="0x18" rw="RW" size="4">
          <bitfield caption="Register B" mask="0xFFFFFFFF" name="RB"/>
        </register>
        <register caption="Register C (channel = 0)" name="TC_RC" offset="0x1C" rw="RW" size="4">
          <bitfield caption="Register C" mask="0xFFFFFFFF" name="RC"/>
        </register>
        <register caption="Status Register (channel = 0)" name="TC_SR" offset="0x20" rw="R" size="4">
          <bitfield caption="Counter Overflow Status (cleared on read)" mask="0x00000001" name="COVFS"/>
          <bitfield caption="Load Overrun Status (cleared on read)" mask="0x00000002" name="LOVRS"/>
          <bitfield caption="RA Compare Status (cleared on read)" mask="0x00000004" name="CPAS"/>
          <bitfield caption="RB Compare Status (cleared on read)" mask="0x00000008" name="CPBS"/>
          <bitfield caption="RC Compare Status (cleared on read)" mask="0x00000010" name="CPCS"/>
          <bitfield caption="RA Loading Status (cleared on read)" mask="0x00000020" name="LDRAS"/>
          <bitfield caption="RB Loading Status (cleared on read)" mask="0x00000040" name="LDRBS"/>
          <bitfield caption="External Trigger Status (cleared on read)" mask="0x00000080" name="ETRGS"/>
          <bitfield caption="End of Receiver Transfer (cleared by writing TC_RCR or TC_RNCR)" mask="0x00000100" name="ENDRX"/>
          <bitfield caption="Reception Buffer Full (cleared by writing TC_RCR or TC_RNCR)" mask="0x00000200" name="RXBUFF"/>
          <bitfield caption="Clock Enabling Status" mask="0x00010000" name="CLKSTA"/>
          <bitfield caption="TIOA Mirror" mask="0x00020000" name="MTIOA"/>
          <bitfield caption="TIOB Mirror" mask="0x00040000" name="MTIOB"/>
        </register>
        <register caption="Interrupt Enable Register (channel = 0)" name="TC_IER" offset="0x24" rw="W" size="4" atomic-op="set:TC_IMR">
          <bitfield caption="Counter Overflow" mask="0x00000001" name="COVFS"/>
          <bitfield caption="Load Overrun" mask="0x00000002" name="LOVRS"/>
          <bitfield caption="RA Compare" mask="0x00000004" name="CPAS"/>
          <bitfield caption="RB Compare" mask="0x00000008" name="CPBS"/>
          <bitfield caption="RC Compare" mask="0x00000010" name="CPCS"/>
          <bitfield caption="RA Loading" mask="0x00000020" name="LDRAS"/>
          <bitfield caption="RB Loading" mask="0x00000040" name="LDRBS"/>
          <bitfield caption="External Trigger" mask="0x00000080" name="ETRGS"/>
          <bitfield caption="End of Receiver Transfer" mask="0x00000100" name="ENDRX"/>
          <bitfield caption="Reception Buffer Full" mask="0x00000200" name="RXBUFF"/>
        </register>
        <register caption="Interrupt Disable Register (channel = 0)" name="TC_IDR" offset="0x28" rw="W" size="4" atomic-op="clear:TC_IMR">
          <bitfield caption="Counter Overflow" mask="0x00000001" name="COVFS"/>
          <bitfield caption="Load Overrun" mask="0x00000002" name="LOVRS"/>
          <bitfield caption="RA Compare" mask="0x00000004" name="CPAS"/>
          <bitfield caption="RB Compare" mask="0x00000008" name="CPBS"/>
          <bitfield caption="RC Compare" mask="0x00000010" name="CPCS"/>
          <bitfield caption="RA Loading" mask="0x00000020" name="LDRAS"/>
          <bitfield caption="RB Loading" mask="0x00000040" name="LDRBS"/>
          <bitfield caption="External Trigger" mask="0x00000080" name="ETRGS"/>
          <bitfield caption="End of Receiver Transfer" mask="0x00000100" name="ENDRX"/>
          <bitfield caption="Reception Buffer Full" mask="0x00000200" name="RXBUFF"/>
        </register>
        <register caption="Interrupt Mask Register (channel = 0)" name="TC_IMR" offset="0x2C" rw="R" size="4" atomic-op="read:TC_IMR">
          <bitfield caption="Counter Overflow" mask="0x00000001" name="COVFS"/>
          <bitfield caption="Load Overrun" mask="0x00000002" name="LOVRS"/>
          <bitfield caption="RA Compare" mask="0x00000004" name="CPAS"/>
          <bitfield caption="RB Compare" mask="0x00000008" name="CPBS"/>
          <bitfield caption="RC Compare" mask="0x00000010" name="CPCS"/>
          <bitfield caption="RA Loading" mask="0x00000020" name="LDRAS"/>
          <bitfield caption="RB Loading" mask="0x00000040" name="LDRBS"/>
          <bitfield caption="External Trigger" mask="0x00000080" name="ETRGS"/>
          <bitfield caption="End of Receiver Transfer" mask="0x00000100" name="ENDRX"/>
          <bitfield caption="Reception Buffer Full" mask="0x00000200" name="RXBUFF"/>
        </register>
      </register-group>
