Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.2.35/samg54/atdf/ATSAMG54G19.atdf
        <register caption="Lock Bits Word 1" name="LOCKBIT_WORD1" offset="0x4" rw="RW" size="4">
          <bitfield caption="Lock Region 32" mask="0x00000001" name="LOCK_REGION_32"/>
          <bitfield caption="Lock Region 33" mask="0x00000002" name="LOCK_REGION_33"/>
          <bitfield caption="Lock Region 34" mask="0x00000004" name="LOCK_REGION_34"/>
          <bitfield caption="Lock Region 35" mask="0x00000008" name="LOCK_REGION_35"/>
          <bitfield caption="Lock Region 36" mask="0x00000010" name="LOCK_REGION_36"/>
          <bitfield caption="Lock Region 37" mask="0x00000020" name="LOCK_REGION_37"/>
          <bitfield caption="Lock Region 38" mask="0x00000040" name="LOCK_REGION_38"/>
          <bitfield caption="Lock Region 39" mask="0x00000080" name="LOCK_REGION_39"/>
          <bitfield caption="Lock Region 40" mask="0x00000100" name="LOCK_REGION_40"/>
          <bitfield caption="Lock Region 41" mask="0x00000200" name="LOCK_REGION_41"/>
          <bitfield caption="Lock Region 42" mask="0x00000400" name="LOCK_REGION_42"/>
          <bitfield caption="Lock Region 43" mask="0x00000800" name="LOCK_REGION_43"/>
          <bitfield caption="Lock Region 44" mask="0x00001000" name="LOCK_REGION_44"/>
          <bitfield caption="Lock Region 45" mask="0x00002000" name="LOCK_REGION_45"/>
          <bitfield caption="Lock Region 46" mask="0x00004000" name="LOCK_REGION_46"/>
          <bitfield caption="Lock Region 47" mask="0x00008000" name="LOCK_REGION_47"/>
          <bitfield caption="Lock Region 48" mask="0x00010000" name="LOCK_REGION_48"/>
          <bitfield caption="Lock Region 49" mask="0x00020000" name="LOCK_REGION_49"/>
          <bitfield caption="Lock Region 50" mask="0x00040000" name="LOCK_REGION_50"/>
          <bitfield caption="Lock Region 51" mask="0x00080000" name="LOCK_REGION_51"/>
          <bitfield caption="Lock Region 52" mask="0x00100000" name="LOCK_REGION_52"/>
          <bitfield caption="Lock Region 53" mask="0x00200000" name="LOCK_REGION_53"/>
          <bitfield caption="Lock Region 54" mask="0x00400000" name="LOCK_REGION_54"/>
          <bitfield caption="Lock Region 55" mask="0x00800000" name="LOCK_REGION_55"/>
          <bitfield caption="Lock Region 56" mask="0x01000000" name="LOCK_REGION_56"/>
          <bitfield caption="Lock Region 57" mask="0x02000000" name="LOCK_REGION_57"/>
          <bitfield caption="Lock Region 58" mask="0x04000000" name="LOCK_REGION_58"/>
          <bitfield caption="Lock Region 59" mask="0x08000000" name="LOCK_REGION_59"/>
          <bitfield caption="Lock Region 60" mask="0x10000000" name="LOCK_REGION_60"/>
          <bitfield caption="Lock Region 61" mask="0x20000000" name="LOCK_REGION_61"/>
          <bitfield caption="Lock Region 62" mask="0x40000000" name="LOCK_REGION_62"/>
          <bitfield caption="Lock Region 63" mask="0x80000000" name="LOCK_REGION_63"/>
        </register>
      </register-group>
    </module>
    <module name="SystemControl" caption="System Control Registers">
      <register-group name="SystemControl" caption="System Control Registers">
        <register offset="0x00000008" size="4" name="ACTLR" initval="0" caption="Auxiliary Control Register,">
          <bitfield mask="0x00000001" name="DISMCYCINT" caption="Disables interruption of multi-cycle instructions."/>
          <bitfield mask="0x00000002" name="DISDEFWBUF" caption="Disables write buffer use during default memory map accesses."/>
          <bitfield mask="0x00000004" name="DISFOLD" caption="Disables folding of IT instructions."/>
        </register>
        <register offset="0x00000d00" size="4" name="CPUID" initval="0x410FC240" caption="CPUID Base Register">
          <bitfield mask="0x0000000f" name="REVISION" caption="Indicates patch release: 0x0 = Patch 0"/>
          <bitfield mask="0x0000fff0" name="PARTNO" caption="Indicates part number"/>
          <bitfield mask="0x00f00000" name="VARIANT" caption="Indicates processor revision: 0x2 = Revision 2"/>
          <bitfield mask="0xff000000" name="IMPLEMENTER" caption="Implementer code"/>
        </register>
        <register offset="0x00000d04" size="4" name="ICSR" initval="0" caption="Interrupt Control and State Register">
          <bitfield mask="0x000001ff" name="VECTACTIVE" caption="Active exception number"/>
          <bitfield mask="0x00000800" name="RETTOBASE" values="RETTOBASE" caption="no description available"/>
          <bitfield mask="0x0003f000" name="VECTPENDING" caption="Exception number of the highest priority pending enabled exception"/>
          <bitfield mask="0x00400000" name="ISRPENDING" caption="no description available"/>
          <bitfield mask="0x00800000" name="ISRPREEMPT" values="ISRPREEMPT" caption="no description available"/>
          <bitfield mask="0x02000000" name="PENDSTCLR" values="PENDSTCLR" caption="no description available"/>
          <bitfield mask="0x04000000" name="PENDSTSET" values="PENDSTSET" caption="no description available"/>
          <bitfield mask="0x08000000" name="PENDSVCLR" values="PENDSVCLR" caption="no description available"/>
          <bitfield mask="0x10000000" name="PENDSVSET" values="PENDSVSET" caption="no description available"/>
          <bitfield mask="0x80000000" name="NMIPENDSET" values="NMIPENDSET" caption="no description available"/>
        </register>
        <register offset="0x00000d08" size="4" name="VTOR" initval="0" caption="Vector Table Offset Register">
          <bitfield mask="0xffffff80" name="TBLOFF" caption="Vector table base offset"/>
        </register>
        <register offset="0x00000d0c" size="4" name="AIRCR" initval="0" caption="Application Interrupt and Reset Control Register">
          <bitfield mask="0x00000001" name="VECTRESET" caption="no description available"/>
          <bitfield mask="0x00000002" name="VECTCLRACTIVE" caption="no description available"/>
          <bitfield mask="0x00000004" name="SYSRESETREQ" values="SYSRESETREQ" caption="no description available"/>
          <bitfield mask="0x00000700" name="PRIGROUP" caption="Interrupt priority grouping field. This field determines the split of group priority from subpriority."/>
          <bitfield mask="0x00008000" name="ENDIANNESS" values="ENDIANNESS" caption="no description available"/>
          <bitfield mask="0xffff0000" name="VECTKEY" caption="Register key"/>
        </register>
